Revit 2027 API
UpdaterId.GetAddInId Method
 AddInId of the UpdaterId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInId GetAddInId()
Public Function GetAddInId As AddInId
public:
AddInId^ GetAddInId()
member GetAddInId : unit -> AddInId
Return Value
AddInId
See Also
Reference
UpdaterId Class
Autodesk.Revit.DB Namespace